// Напишите программу, которая принимает на вход целое число любой разрядности и проверяет, является ли оно палиндромом. Через строку нельзя решать само собой.
Console.WriteLine("Введите число");
int num=Convert.ToInt32(Console.ReadLine());
int numDigit = (int) Math.Log(num,10)+1;
Console.WriteLine("digit "+numDigit);
string PalinCheck (int arg)
{
    
}